## Staging: performance-test
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 17 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.perf_test_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "perf_test_container_definition"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [
              {
                "logConfiguration": {
                  "logDriver": "awslogs",
                  "options": {
                    "awslogs-group": "${AWS_LOGS_GROUP}",
                    "awslogs-region": "${AWS_LOGS_REGION}",
                    "awslogs-stream-prefix": "${AWS_LOGS_STREAM_PREFIX}"
                  }
                },
                "volumesFrom": [],
                "essential": true,
                "name": "performance test",
                "image": "${aws_ecr_repository.performance-test.repository_url}",
                
                "environment": [
                  {
                    "name": "PERF_TEST_AWS_S3_BUCKET",
                    "valueFrom": "${PERF_TEST_AWS_S3_BUCKET}"
                  },
                  {
                    "name": "PERF_TEST_CSV_DIRECTORY_PATH",
                    "valueFrom": "${PERF_TEST_CSV_DIRECTORY_PATH}"
                  },
                  {
                    "name": "PERF_TEST_SMS_TEMPLATE_ID",
                    "valueFrom": "${PERF_TEST_SMS_TEMPLATE_ID}"
                  },
                  {
                    "name": "PERF_TEST_BULK_EMAIL_TEMPLATE_ID",
                    "valueFrom": "${PERF_TEST_BULK_EMAIL_TEMPLATE_ID}"
                  },
                  {
                    "name": "PERF_TEST_EMAIL_TEMPLATE_ID",
                    "valueFrom": "${PERF_TEST_EMAIL_TEMPLATE_ID}"
                  },
                  {
                    "name": "PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID",
                    "valueFrom": "${PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID}"
                  },
                  {
                    "name": "PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID",
                    "valueFrom": "${PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID}"
                  },
                ],
                "secrets": [
                  {
                    "name": "PERF_TEST_PHONE_NUMBER",
                    "valueFrom": "${PERF_TEST_PHONE_NUMBER}"
                  },
                  {
                    "name": "PERF_TEST_EMAIL",
                    "valueFrom": "${PERF_TEST_EMAIL}"
                  },
                  {
                    "name": "PERF_TEST_DOMAIN",
                    "valueFrom": "${PERF_TEST_DOMAIN}"
                  },
                  {
                    "name": "TEST_AUTH_HEADER",
                    "valueFrom": "${TEST_AUTH_HEADER}"
                  },
                ]
              }
            ]
        EOT
      + vars     = {
          + "AWS_LOGS_GROUP"                              = "performance_test_cluster"
          + "AWS_LOGS_REGION"                             = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX"                      = "performance_test_cluster-task"
          + "PERF_TEST_AWS_S3_BUCKET"                     = "notify-performance-test-results-staging"
          + "PERF_TEST_BULK_EMAIL_TEMPLATE_ID"            = "fa759679-30f2-4666-94e2-bd4921329c46"
          + "PERF_TEST_CSV_DIRECTORY_PATH"                = "/tmp/notify_performance_test"
          + "PERF_TEST_EMAIL_TEMPLATE_ID"                 = "fa759679-30f2-4666-94e2-bd4921329c46"
          + "PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID" = "fa759679-30f2-4666-94e2-bd4921329c46"
          + "PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID"       = "9fb324a5-821d-4b54-9d52-d9ba1fa8373a"
          + "PERF_TEST_SMS_TEMPLATE_ID"                   = "d5fea9f3-f69d-481e-9186-b7f4eaa5cf63"
        }
    }

  # aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "perf_test_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 0 * * ? *)"
      + tags                = {
          + "Name" = "perf_test_cw_event_rule"
        }
      + tags_all            = {
          + "Name" = "perf_test_cw_event_rule"
        }
    }

  # aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = (known after apply)
      + rule           = "perf_test_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + enable_ecs_managed_tags = false
          + enable_execute_command  = false
          + launch_type             = "FARGATE"
          + platform_version        = "1.4.0"
          + propagate_tags          = "TASK_DEFINITION"
          + task_count              = 1
          + task_definition_arn     = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = (known after apply)
              + subnets          = [
                  + "subnet-0c7d18c0c51b28b61",
                  + "subnet-0c91f7c6b8211904b",
                  + "subnet-0cecd9e634daf82d3",
                ]
            }
        }
    }

  # aws_cloudwatch_log_group.perf_test_ecs_logs will be created
  + resource "aws_cloudwatch_log_group" "perf_test_ecs_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "performance_test_cluster"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_metric_filter.ecs_task_error_metric will be created
  + resource "aws_cloudwatch_log_metric_filter" "ecs_task_error_metric" {
      + id             = (known after apply)
      + log_group_name = "performance_test_cluster"
      + name           = "EcsTaskError-perf-test"
      + pattern        = "Error"

      + metric_transformation {
          + name      = "EcsTaskError-perf-test"
          + namespace = "perf_test_metrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_ecs_cluster.perf_test will be created
  + resource "aws_ecs_cluster" "perf_test" {
      + arn                = (known after apply)
      + capacity_providers = [
          + "FARGATE",
        ]
      + id                 = (known after apply)
      + name               = "performance_test_cluster"
      + tags               = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + tags_all           = {
          + "CostCentre" = "notification-canada-ca-staging"
        }

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 1
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_task_definition.perf_test_task will be created
  + resource "aws_ecs_task_definition" "perf_test_task" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2"
      + execution_role_arn       = (known after apply)
      + family                   = "performance_test_cluster"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + tags_all                 = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_iam_policy.perf_test_ecs_task_get_ecr_image will be created
  + resource "aws_iam_policy" "perf_test_ecs_task_get_ecr_image" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "PerformanceTestEcsTaskGetEcrImage"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/performance-test"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.container_execution_role will be created
  + resource "aws_iam_role" "container_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "container_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.perf_test_ecs_task will be created
  + resource "aws_iam_role" "perf_test_ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "performance_test_cluster-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.server_metrics_container_execution_role will be created
  + resource "aws_iam_role" "server_metrics_container_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "server_metrics_container_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ce_cs will be created
  + resource "aws_iam_role_policy_attachment" "ce_cs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "container_execution_role"
    }

  # aws_iam_role_policy_attachment.perf_test_ecs_task_ec2_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "perf_test_ecs_task_ec2_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "performance_test_cluster-ecs-task"
    }

  # aws_iam_role_policy_attachment.perf_test_ecs_task_get_ecr_image_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "perf_test_ecs_task_get_ecr_image_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "performance_test_cluster-ecs-task"
    }

  # aws_iam_role_policy_attachment.perf_test_ecs_task_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "perf_test_ecs_task_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "performance_test_cluster-ecs-task"
    }

  # aws_iam_role_policy_attachment.perf_test_s3_attach will be created
  + resource "aws_iam_role_policy_attachment" "perf_test_s3_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/NotifyPerformanceTestS3Access"
      + role       = "performance_test_cluster-ecs-task"
    }

  # aws_iam_role_policy_attachment.server_metrics_ce_cs will be created
  + resource "aws_iam_role_policy_attachment" "server_metrics_ce_cs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "server_metrics_container_execution_role"
    }

  # aws_lambda_function.performance-test will be updated in-place
  ~ resource "aws_lambda_function" "performance-test" {
        id                             = "performance-test"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:performance-test:2" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "PERF_TEST_BULK_EMAIL_TEMPLATE_ID"            = "5ebee3b7-63c0-4052-a8cb-387b818df627" -> "fa759679-30f2-4666-94e2-bd4921329c46"
              ~ "PERF_TEST_DOMAIN"                            = "https://api.staging.notification.cdssandbox.xyz" -> "test domain"
              ~ "PERF_TEST_EMAIL"                             = "success@simulator.amazonses.com" -> "test email"
              ~ "PERF_TEST_EMAIL_TEMPLATE_ID"                 = "a59b313d-8de2-4973-ac2f-66de7ec0b239" -> "fa759679-30f2-4666-94e2-bd4921329c46"
              ~ "PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID" = "a59b313d-8de2-4973-ac2f-66de7ec0b239" -> "fa759679-30f2-4666-94e2-bd4921329c46"
              ~ "PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID"       = "5ebee3b7-63c0-4052-a8cb-387b818df627" -> "9fb324a5-821d-4b54-9d52-d9ba1fa8373a"
              ~ "PERF_TEST_PHONE_NUMBER"                      = "16132532222" -> "test phone"
              ~ "PERF_TEST_SMS_TEMPLATE_ID"                   = "83d01f06-a818-4134-bd69-ce90a2949280" -> "d5fea9f3-f69d-481e-9186-b7f4eaa5cf63"
              ~ "TEST_AUTH_HEADER"                            = "apikey-v1 c55039fc-c0e1-44db-a14e-b6a669148ec6" -> "test header"
                # (2 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_security_group.perf_test will be created
  + resource "aws_security_group" "perf_test" {
      + arn                    = (known after apply)
      + description            = "Performance Test Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "perf_test"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

Plan: 17 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>